In [23]:
import pandas as pd
b1 = pd.read_csv("basic1.csv")
b1.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [5]:
#f5컬럼 기준으로 상위 10개의 데이터를 구하기

b1 = b1.sort_values('f5',ascending=False)
b1.head(10)

      id   age city    f1  f2   f3    f4         f5
10  id11  40.0   서울  68.0   0  NaN  ENFP  98.429899
9   id10  95.0   서울  74.0   1  NaN  ISFP  98.429899
76  id77  77.0   경기  31.0   0  NaN  INFP  98.429899
97  id98  39.0   경기  58.0   2  NaN  INFP  98.429899
98  id99   1.0   경기  47.0   0  NaN  ESFJ  97.381034
91  id92  97.0   경기  78.0   1  NaN  INFP  97.381034
86  id87  19.0   경기   NaN   1  NaN  ISFP  97.381034
71  id72   8.0   경기  97.0   0  NaN  ESTJ  97.381034
11  id12  20.0   서울   NaN   0  NaN  ESTP  91.297791
19  id20  11.0   서울  51.0   1  NaN  INTJ  91.297791

In [7]:
#f5컬럼 10개중 최솟값으로 대체
b1_min = b1['f5'][1:10].min()
b1_min

91.29779092

In [11]:
b1['f5'][:10] = b1_min
b1.head(10)

<ipython-input-11-52f7b4138fa3>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  b1['f5'][:10] = b1_min

      id   age city    f1  f2   f3    f4         f5
10  id11  40.0   서울  68.0   0  NaN  ENFP  91.297791
9   id10  95.0   서울  74.0   1  NaN  ISFP  91.297791
76  id77  77.0   경기  31.0   0  NaN  INFP  91.297791
97  id98  39.0   경기  58.0   2  NaN  INFP  91.297791
98  id99   1.0   경기  47.0   0  NaN  ESFJ  91.297791
91  id92  97.0   경기  78.0   1  NaN  INFP  91.297791
86  id87  19.0   경기   NaN   1  NaN  ISFP  91.297791
71  id72   8.0   경기  97.0   0  NaN  ESTJ  91.297791
11  id12  20.0   서울   NaN   0  NaN  ESTP  91.297791
19  id20  11.0   서울  51.0   1  NaN  INTJ  91.297791

In [14]:
#80세 이상의 f5평균
b_80 = b1[b1['age']>=80]
b_80.head()

      id   age city    f1  f2   f3    f4         f5
9   id10  95.0   서울  74.0   1  NaN  ISFP  91.297791
91  id92  97.0   경기  78.0   1  NaN  INFP  91.297791
93  id94  84.0   경기   NaN   1  NaN  ESTJ  90.496999
51  id52  97.0   대구  82.0   1  NaN  ISFJ  90.496999
37  id38  87.0   부산   NaN   1  NaN  ESTP  83.685380

In [15]:
b_80['f5'].mean()

62.497747125217394

In [16]:
b1 = pd.read_csv("basic1.csv")
b1.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [21]:
#앞에서 순서대로 70%의 데이터만 활용
import pandas as pd
import numpy as np
b1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      100 non-null    object
 1   age     100 non-null    float64
 2   city    100 non-null    object
 3   f1      69 non-null     float64
 4   f2      100 non-null    int64
 5   f3      5 non-null      object
 6   f4      100 non-null    object
 7   f5      100 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.4+ KB

In [23]:
b1_n = b1.iloc[:70,]
b1_n.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      70 non-null     object
 1   age     70 non-null     float64
 2   city    70 non-null     object
 3   f1      47 non-null     float64
 4   f2      70 non-null     int64
 5   f3      3 non-null      object
 6   f4      70 non-null     object
 7   f5      70 non-null     float64
dtypes: float64(3), int64(1), object(4)
memory usage: 4.5+ KB

In [25]:
#f1컬럼 결측치를 중앙값으로 채우기 전 후의 표준편차
#채우기 전

print(b1_n['f1'].std())

17.98727579865276

In [35]:
#채운 후

f1_n = b1_n['f1'].fillna(b1_n['f1'].median())
b1_n2['f1'] = f1_n
print(b1_n2['f1'].isnull().sum())
print(b1_n2['f1'].std())

0
14.690773995256688

In [36]:
#두 표준편차의 차이 구하기 
print(b1_n['f1'].std()-b1_n2['f1'].std())

3.2965018033960725

In [15]:
#age 컬럼의 이상치 더하기 
#이상치는 평균 +-표준편차 *1.5

age_mean = b1['age'].mean()
print(age_mean)
age_std = b1['age'].std()
print(age_std)


ee = b1[(b1['age'] < age_mean - 1.5*age_std)|(b1['age'] > age_mean+1.5*age_std)]
print(ee['age'].sum())

50.963
30.442758522588697
473.5

In [61]:
#b1 이상치 제거하기
b1_2 = pd.read_csv('basic1.csv')
print(b1_2)
print(b1_2.shape)

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]
(100, 8)

In [62]:
#0보다 작은 숫자 제거
b1_2 = b1_2[b1_2['age'] > 0]
b1_2.shape

(96, 8)

In [63]:
#소수점 제거
b1_2 = b1_2[b1_2['age'].astype('int') == b1_2['age']]
b1_2.shape

(90, 8)

In [64]:
#나이순으로 3그룹으로 나누기
#기준확인

pd.qcut(b1_2['age'],q=3)

0      (0.999, 38.667]
1      (0.999, 38.667]
2      (0.999, 38.667]
3      (73.333, 100.0]
4      (0.999, 38.667]
            ...
95     (73.333, 100.0]
96     (73.333, 100.0]
97    (38.667, 73.333]
98     (0.999, 38.667]
99    (38.667, 73.333]
Name: age, Length: 90, dtype: category
Categories (3, interval[float64]): [(0.999, 38.667] < (38.667, 73.333] < (73.333, 100.0]]

In [65]:
b1_2['range'] = pd.qcut(b1_2['age'],q=3,labels = ['1','2','3'])
b1_2.head()

     id   age city    f1  f2   f3    f4         f5 range
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791     1
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826     1
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986     1
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078     3
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869     1

In [66]:
b1_2['range'].value_counts()

1    30
2    30
3    30
Name: range, dtype: int64

In [68]:
#각 그룹의 중앙값 더하기
m1 = b1_2[b1_2['range'] == '1']['age'].median()
m2 = b1_2[b1_2['range'] == '2']['age'].median()
m3 = b1_2[b1_2['range'] == '3']['age'].median()

print(m1+m2+m3)

165.0